Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/transition_from_ofp.html.txt.tmx
Source language: en
Languages: ga

source: Transition from One-Parent Family Payment
ga: Aistriú ó Íocaíocht Teaghlach Aontuismitheora

source: On 2 July 2015 the age limit for the One-Parent Family Payment (OFP) reduced to 7 years for most claimants
ga: An 2 Iúil 2015, tháinig laghdú ar an aoisteorainn d’Íocaíocht Teaghlach Aontuismitheora (ÍTA) anuas go dtí 7 mbliana i measc fhormhór na n-éilitheoirí

source: This meant that a large number of people no longer qualified for OFP from July 2015 because their youngest child was over the age limit
ga: Ciallaíonn seo nach gcáileoidh líon mór daoine a thuilleadh don ÍTA ó Iúil 2015 ar aghaidh mar gheall go bhfuil a leanbh is óige os cionn na haoisteorann

source: There are exemptions to the age limit for people parenting alone who are getting a Domiciliary Care Allowance or Blind Pension, who are caring or who have been recently bereaved
ga: Tá eisceachtaí maidir leis an aoisteorainn i measc daoine a dhéanann tuistiú aonair a bhfuil Liúntas Cúram Baile nó Pinsean na nDall á fháil acu, a thugann cúram do dhuine nó a bhí thíos le méala le déanaí

source: This document gives an overview of the options open to you
ga: Tugtar forbhreathnú sa cháipéis seo ar na roghanna atá ar fáil duit

source: You can also get more information and advice at your Intreo Centre or Social Welfare Branch Office or your nearest Citizens Information Centre
ga: Féadfaidh tú breis faisnéise agus comhairle a fháil ag d’Ionad Intreo nó ag d’oifig áitiúil leasa shóisialaigh nó ag an Ionad um Fhaisnéis do Shaoránaigh is gaire duit

source: Most people who no longer qualify for a One-Parent Family Payment because their youngest child is aged 7 will transfer to the Jobseeker’s Transitional payment (called JST)
ga: Aistreofar formhór na ndaoine nach gcáilíonn a thuilleadh d’Íocaíocht Teaghlach Aontuismitheora mar gheall go bhfuil a leanbh 7 mbliana d’aois, chuig íocaíocht Idirthréimhseach Chuardaitheora Poist (ar a dtugtar ICP)

source: JST is paid to people who are not cohabiting and whose youngest child is aged between 7 and 13
ga: Íoctar ICP le daoine nach bhfuil ag comhchónaí le duine agus a bhfuil a leanbh is óige idir 7 agus 13 bliana d’aois

source: It aims to support you into the workforce while also acknowledging that you are caring for young children
ga: Tá de chuspóir ag an íocaíocht tacú leat áit a bhaint amach sa lucht saothair agus a aithint, i gcomhthráth, go bhfuil cúram á thabhairt agat do leanaí óga

source: You can take part in a course of education and get JST
ga: Féadfaidh tú páirt a ghlacadh i gcúrsa oideachais agus ICP a fháil

source: You can get more information in our document on the Jobseeker’s Transitional payment
ga: Is féidir leat teacht ar thuilleadh faisnéise inár gcáipéis ar Íocaíocht Idirthréimhseach Chuardaitheora Poist

source: OFP and Family Income Supplement
ga: An ÍTA agus Forlíonadh Ioncam Teaghlaigh

source: If you are working and getting Family Income Supplement (FIS) in addition to OFP, your FIS payment will be automatically reviewed when your OFP ends
ga: Má tá tú ag oibriú agus Forlíonadh Ioncam Teaghlaigh (FIT) á fháil agat anuas ar do ÍTA, déanfar athbhreithniú uathoibríoch ar d’íocaíocht FIT nuair a chríochnaíonn do ÍTA

source: In most cases this will lead to an increase in your FIS payment
ga: I bhformhór na gcásanna, eascróidh méadú as seo ar d’íocaíocht FIT

source: You may also qualify for the Back to Work Family Dividend (BTWFD)
ga: Anuas air sin, d’fhéadfá cáiliú don Díbhinn Teaghlaigh um Fhilleadh ar Obair (DTFAO)

source: This payment allows parents getting One-Parent Family Payment or a jobseeker’s payment to keep the full Increase for a Qualified Child (€29.80 per week per child) for the first year of employment or self-employment and half that amount in the second year
ga: Ceadaíonn an íocaíocht nua seo do thuismitheoirí a bhfuil Íocaíocht Teaghlach Aontuismitheora nó íocaíocht chuardaitheora poist á fáil acu chun an Méadú iomlán do Leanbh Cáilithe (€29.80 sa tseachtain in aghaidh an linbh) a choimeád don chéad bhliain fostaíochta nó féinfhostaíochta agus leath na suime sin a choimeád sa dara bliain

source: BTWFD can be paid as well as FIS and it will have no impact on your entitlement to FIS
ga: Féadtar an DTFAO a íoc mar aon le FIT agus ní bheidh aon tionchar aige ar do theidlíocht do FIT

source: If you have a general question about FIS you can call the FIS section at (043) 334 0053 or e-mail FISSection@welfare.ie
ga: Má bhíonn ceisteanna ginearálta agat faoin FIT, féadfaidh tú glao ar an rannóg FIT ar (043) 334 0053 nó ríomhphost a sheoladh chuig FISSection@welfare.ie

source: OFP and Carer’s Allowance
ga: ÍTA agus Liúntas Cúramóra

source: People parenting alone, who meet the qualifying criteria for Carer's Allowance, may qualify for both One-Parent Family Payment and half-rate Carer's Allowance (CA)
ga: Féadfaidh daoine a dhéanann tuistiú aonair, a thugann cúram do dhuine dá leanaí nó do dhuine fásta (ar nós tuismitheora nó siblín) cáiliú anois do ÍTA agus do Liúntas Cúramóra leathráta, a fhad agus atá a leanbh is óige faoi bhun 16 bliana d’aois

source: If your youngest child is aged between 7 and 15, you must qualify for Carer's Allowance to continue to get OFP
ga: (Achtaíodh leasú leis an Acht Leasa Shóisialaigh (Comhdhlúthú), 2005 chun an t-athrú seo a cheadú)

source: You will also get an Increase for a Qualified Child (IQC) for any other children in the family until they reach 18 (or 22 if in full-time education) while CA and OFP is in payment
ga: Anuas air sin, gheobhaidh tú Méadú do Leanbh Cáilithe (MLC) d’aon leanaí eile sa teaghlach go dtí go mbainfidh siad 18 mbliana d’aois amach (nó 22 bliain d’aois má tá siad in oideachas lánaimseartha) fad atá LC agus ÍTA á n-íoc

source: (See our document on One-Parent Family Payment for more information on other exceptions to the age limits.)
ga: Má bhí ÍTA agus LC leathráta á bhfáil agat roimhe seo, agus má rinne leasuithe athrú aoise ÍTA difear duit, tá tú anois i dteideal chun iarratas a dhéanamh ar an dá íocaíocht

source: This means that you can claim OFP and a half-rate Carer’s Allowance until your youngest child turns 16 provided you continue to meet the conditions for both schemes
ga: Cuimsíonn an fhoráil seo iontrálaithe nua chuig an scéim ÍTA, a bhfuil a leanbh is óige idir 7 agus 15 bliana, na blianta sin san áireamh, nuair a cháilíonn siad do Liúntas Cúramóra

source: OFP and Domiciliary Care Allowance
ga: ÍTA agus Liúntas Cúram Baile

source: If you are getting Domiciliary Care Allowance (DCA) for one of your children, the age limit of 7 for the youngest child does not apply, and you can retain your OFP payment
ga: Má tá Liúntas Cúram Baile (LCB) á fháil agat do dhuine de do leanaí, ní bhaineann an aoisteorainn 7 mbliana don leanbh is óige, agus féadfaidh tú d’íocaíocht ÍTA a choimeád

source: This means that you can continue to qualify for OFP until that child is aged 16 or your DCA stops
ga: Ciallaíonn seo gur féidir leat leanúint le cáiliú do ÍTA go dtí go mbaineann an leanbh sin 16 bliana d’aois amach nó go gcuirtear stop le do LCB

source: You will also get an Increase for a Qualified Child (IQC) for any other children in the family until they reach 18 (or 22 if in full-time education) while DCA and OFP is in payment
ga: Anuas air sin, gheobhaidh tú Méadú do Leanbh Cáilithe (MLC) d’aon leanaí eile sa teaghlach go dtí go mbainfidh siad 18 mbliana d’aois amach (nó 22 bliain d’aois má tá siad in oideachas lánaimseartha) fad atá an LCB agus an ÍTA á n-íoc

source: If your youngest child is under 7 years of age when your DCA stops you may also continue to qualify for OFP
ga: Má tá do leanbh is óige faoi bhun 7 mbliana d’aois nuair a chuirtear stop le do LCB, féadfaidh tú leanúint le cáiliú do ÍTA chomh maith

source: OFP and Blind Pension
ga: ÍTA agus Pinsean na nDall

source: Blind Pension is payable with OFP
ga: Tá Pinsean na nDall iníoctha le ÍTA

source: This means that a person who qualifies for OFP and Blind Pension can get both payments at the full rate
ga: Ciallaíonn seo gur féidir le duine a cháilíonn dó ÍTA agus Pinsean na nDall an dá íocaíocht a fháil ar an ráta iomlán

source: People who qualify for Blind Pension will be exempted from the age conditions for OFP
ga: Beidh daoine a cháilíonn do Phinsean na nDall díolmhaithe ó na coinníollacha aoise do ÍTA

source: This means that you can claim both Blind Pension and OFP (and any IQCs payable with both Blind Pension and OFP) together until your youngest child is 16 years of age
ga: Ciallaíonn seo gur féidir leat Pinsean na nDall agus ÍTA (agus aon mhéaduithe do leanaí cáilithe atá iníoctha le Pinsean na nDall agus ÍTA) a éileamh i dteannta a chéile go dtí go mbaineann do leanbh 16 bliana d’aois amach

source: OFP and return to education
ga: ÍTA agus filleadh ar oideachas

source: If you are taking part in a recognised education course when your entitlement to OFP ends you can finish your course and get a payment
ga: Má tá páirt á glacadh agat i gcúrsa aitheanta oideachais nuair a chríochnaíonn do theidlíocht do ÍTA, féadfaidh tú do chúrsa a chríochnú agus íocaíocht a fháil

source: The payment you qualify for depends on your circumstances
ga: Braitheann an íocaíocht a gcáilíonn tú di ar do chúinsí

source: If you are in education and your OFP ends because your youngest child has reached the age limit you can move to the Jobseeker’s Transitional payment (JST) and continue your course
ga: Má tá páirt á glacadh agat faoi láthair i gcúrsa lánaimseartha oideachais agus má bheidh do ÍTA ag críochnú an 2 Iúil 2015, féadfaidh tú leanúint le ÍTA a fháil go dtí go gcríochnaíonn tú do chúrsa

source: You can claim JST and a student grant at the same time and the grant will not be assessed as means for JST
ga: Féadfaidh tú leanúint le deontas cothabhála a éileamh agus ní dhéanfar measúnú ar an deontas mar mhaoin i leith do ÍTA

source: However, you should note that you cannot claim Rent Supplement if you are getting a student grant or if you are in full-time education
ga: Níl an socrú seo ach do dhaoine a mbeidh deireadh ag teacht lena n-éileamh ar ÍTA an 2 Iúil 2015 amháin

source: It is important to remember that your entitlement to JST will end when your youngest child reaches the age of 14
ga: Beidh socrú aonair i gceist i ndiaidh an 2 Iúil 2015

source: If you have not finished your course when your youngest child reaches the age of 14 you will have to either transfer to the Back to Education Allowance to complete your course or opt to remain in receipt of your student grant. OFP and employment schemes
ga: Má tá tú in oideachas agus má chuirtear deireadh le do ÍTA mar gheall gur bhain do leanbh is óige an aoisteorainn amach, féadfaidh tú aistriú chuig íocaíocht Idirthréimhseach Chuardaitheora Poist (ICP) agus leanúint le do chúrsa

source: If you are on an employment scheme (such as Community Employment) when your entitlement to OFP ends you can continue on the scheme until it finishes and get a payment
ga: Féadfaidh tú ICP agus deontas cothabhála a éileamh ag an tráth céanna agus ní dhéanfar an deontas a mheasúnú mar mhaoin don ICP

source: DSP staff will arrange this for you
ga: Ba cheart duit a thabhairt faoi deara, áfach, nach féidir leat Forlíonadh Cíosa a éileamh má tá deontas cothabhála á fháil agat nó má tá tú in oideachas lánaimseartha

source: Most sources of income (including OFP) are taken into account in the means test for social housing support and the calculation of differential rents
ga: Is tábhachtach go gcuimhníonn tú go dtiocfaidh deireadh le do theidlíocht do ICP nuair a bhaineann do leanbh is óige 14 bliana d’aois amach

source: If you are applying for social housing, you should notify the local authority of any change in your income so that your means can be reassessed
ga: Má tá tú ag tabhairt faoi chúrsa oiliúna breisoideachais agus oiliúna agus má tá ÍTA á fháil agat, déanfar socruithe leis an Roinn Oideachais agus Scileanna chun d’íocaíocht a ghlacadh i gcúram

source: If you are already renting from a local authority or a housing association, you should notify them of any change in your income so that your rent can be recalculated
ga: Má tá tú ag tabhairt faoi chlár oideachais scéim deiseanna oiliúna gairmoideachais agus má tá ÍTA á fháil agat, féadfaidh tú teagmháil a dhéanamh le comhordaitheoir do chúrsa BOO go ndéanfar liúntas oiliúna a íoc leat

source: If you are on Rent Supplement, any change in your circumstances may affect your entitlement and you should notify the Department of Social Protection office that pays your Rent Supplement. In particular, as noted above, you cannot claim Rent Supplement if you are getting a student grant or if you are in full-time education
ga: Má tá tú rannpháirteach i scéim fostaíochta (ar nós Fostaíocht Pobail) nuair a chríochnaíonn do theidlíocht don ÍTA, féadfaidh tú leanúint bheith rannpháirteach sa scéim go dtí go gcríochnaíonn sí agus íocaíocht a fháil

source: There is also a limit to the number of hours you can work per week and continue to get Rent Supplement
ga: Socróidh foireann an RCS seo duit
